serv/УчетЧековСотрудниковСервер/src/Documents/ЧекЗаПитание/ЧекЗаПитание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЧекЗаПитание</name>
  <registerRecords>AccumulationRegister.ЗатратыНаПитание</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФотоЧека</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Document>

serv/УчетЧековСотрудниковСервер/src/AccumulationRegisters/ЗатратыНаПитание/ЗатратыНаПитание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗатратыНаПитание</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

serv/УчетЧековСотрудниковСервер/src/Documents/ЧекЗаПитание/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ЗатратыНаПитание 
	Движения.ЗатратыНаПитание.Записывать = Истина;
	Движение = Движения.ЗатратыНаПитание.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Сумма = Сумма;

КонецПроцедуры
